In [1]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder

In [6]:
df=pd.read_csv("loan-train.csv")

In [7]:
df.shape

(614, 13)

In [8]:
df[0:2]

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N

In [9]:
df.isnull().sum()

Loan_ID               0
Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [12]:
df.dropna(inplace=True)

In [13]:
df['Dependents']=df['Dependents'].replace(['3+'],3)
#TO replace the data values

In [15]:
df['Dependents'].unique()

array(['1', '0', '2', 3], dtype=object)

In [16]:
df.shape

(480, 13)

In [17]:
df[0:2]

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y

In [23]:
l=LabelEncoder()
g=l.fit_transform(df['Gender'])
m=l.fit_transform(df['Married'])
e=l.fit_transform(df['Education'])
p=l.fit_transform(df['Property_Area'])
s=l.fit_transform(df['Self_Employed'])

In [24]:
df['gender']=g
df['Married or Not']=m
df['Edu']=e
df['Property']=p
df['Employed']=s

In [25]:
df[0:2]

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status,gender,Married or Not,Edu,Property,Employed
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N,1,1,0,0,0
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y,1,1,0,2,1

In [28]:
df1=df.drop(['Loan_ID','Gender','Married','Property_Area','Education','Self_Employed'],axis=1)

In [29]:
df1[0:2]

,Dependents,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Loan_Status,gender,Married or Not,Edu,Property,Employed
1,1,4583,1508.0,128.0,360.0,1.0,N,1,1,0,0,0
2,0,3000,0.0,66.0,360.0,1.0,Y,1,1,0,2,1

In [30]:
X=df1.drop('Loan_Status',axis=1)
y=df1['Loan_Status']

In [32]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.25)

In [33]:
from sklearn.naive_bayes import GaussianNB
nb=GaussianNB()
nb.fit(X_train,y_train)
status=nb.predict(X_test)

In [36]:
from sklearn.metrics import confusion_matrix,accuracy_score
accuracy_score(status,y_test)

0.8083333333333333

In [37]:
confusion_matrix(status,y_test)

array([[19,  5],
       [18, 78]], dtype=int64)

In [38]:
from sklearn.linear_model import LogisticRegression
log=LogisticRegression()
log.fit(X_train,y_train)
st=log.predict(X_test)
accuracy_score(st,y_test)

0.825

In [39]:
confusion_matrix(st,y_test)

array([[17,  1],
       [20, 82]], dtype=int64)